Autodesk.Revit.DB.CurveElement.GetLineStyleIds
Ids of all line style Elements that are applicable to this curve element.
Remarks:
The elements are of the Autodesk.Revit.DB.GraphicsStyle class.
Returns:
A collection of Ids of line style elements.

Autodesk.Revit.DB.CurveElement.LineStyle
The line style of this curve element.
Remarks: The return of this property will be a Autodesk.Revit.DB.GraphicsStyle element.
These graphics styles should be associated to subcategories of the BuiltInCategory OST_Lines.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when argument is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when regeneration failed. -- or --
Thrown when fail to get line style.